#include "MPU6050.H" 


//*****************************************************************************************************
//向I2C设备写入一个字节数据
//*****************************************************************************************************
void MPU_Write_Byte(u8 REG_Address,u8 REG_data)
{
    I2C_Start();                  //起始信号
    I2C_SendByte(SlaveAddress);   //发送设备地址+写信号
    I2C_SendByte(REG_Address);    //内部寄存器地址，
    I2C_SendByte(REG_data);       //内部寄存器数据，
    I2C_Stop();                   //发送停止信号
}
//*******************************************************************************************************
//从I2C设备读取一个字节数据
//*******************************************************************************************************
u8 MPU_Read_Byte(u8 REG_Address)
{
	u8 REG_data;
	I2C_Start();                   //起始信号
	I2C_SendByte(SlaveAddress);    //发送设备地址+写信号
	I2C_SendByte(REG_Address);     //发送存储单元地址，从0开始	
	I2C_Start();                   //起始信号
	I2C_SendByte(SlaveAddress+1);  //发送设备地址+读信号
 	REG_data=I2C_RecvByte(1);       //读出寄存器数据
	I2C_SendACK(1);                //接收应答信号
	I2C_Stop();                    //停止信号
	return REG_data;
}
////*********************************************************************************************************
////IIC连续写
////addr:器件地址 
////reg:寄存器地址
////len:写入长度
////buf:数据区
////返回值:0,正常
////    其他,错误代码
//u8 MPU_Write_Len(u8 addr,u8 reg,u8 len,u8 *buf)
//{
//	u8 i; 
//  I2C_Start(); 
//	I2C_SendByte(SlaveAddress);//发送器件地址+写命令	
//	if(I2C_RecvACK())	//等待应答
//	{
//		I2C_Stop();		 
//		return 1;		
//	}
//    I2C_SendByte(reg);	//写寄存器地址
//    I2C_RecvACK();		//等待应答
//	for(i=0;i<len;i++)
//	{
//		I2C_SendByte(buf[i]);	//发送数据
//		if(I2C_RecvACK())		//等待ACK
//		{
//			I2C_Stop();	 
//			return 1;		 
//		}		
//	}    
//  I2C_Stop();	 
//	return 0;	
//} 
////********************************************************************************************************
////IIC连续读
////addr:器件地址
////reg:要读取的寄存器地址
////len:要读取的长度
////buf:读取到的数据存储区
////返回值:0,正常
////    其他,错误代码
//u8 MPU_Read_Len(u8 addr,u8 reg,u8 len,u8 *buf)
//{ 
// 	I2C_Start(); 
//	I2C_SendByte(SlaveAddress);//发送器件地址+写命令	
//	if(I2C_RecvACK())	//等待应答
//	{
//		I2C_Stop();		 
//		return 1;		
//	}
//  I2C_SendByte(reg);	//写寄存器地址
//  I2C_RecvACK();		//等待应答
//  I2C_Start();
//	I2C_SendByte(SlaveAddress+1);//发送器件地址+读命令	
//  I2C_RecvACK();		//等待应答 
//	while(len)
//	{
//		if(len==1)
//			*buf=I2C_RecvByte(1);//读数据,发送nACK 
//		else 
//			*buf=I2C_RecvByte(0);	//读数据,发送ACK  
//		len--;
//		buf++; 
//	}    
//    I2C_Stop();	//产生一个停止条件 
//	return 0;	
//}
//******************************************************************************************************
//初始化MPU6050
//******************************************************************************************************
void InitMPU6050(void)
{
	MPU_Write_Byte(PWR_MGMT_1, 0x00);	//解除休眠状态
	MPU_Write_Byte(SMPLRT_DIV, 0x07);  //陀螺仪采样率分频 1K/(0x07+1) =125hz
	MPU_Write_Byte(CONFIG, 0x03);      //低通滤波频率一般为采样器频率一半，这里取近似值（陀螺仪）42hz（加速度计）44hz
	MPU_Write_Byte(GYRO_CONFIG, 0x18);  //陀螺仪测量范围(不自检，2000deg/s)
	MPU_Write_Byte(ACCEL_CONFIG, 0x01);  //加速度计测量范围(不自检，2G，5Hz)
}
//******************************************************************************************************
//合成数据
//******************************************************************************************************
int GetData(u8 REG_Address)
{
	u8 H,L;
	H=MPU_Read_Byte(REG_Address);
	L=MPU_Read_Byte(REG_Address+1);
	return ((H<<8)+L);   //合成数据
}

/*********************************END FILE*************************************/








